# O PC
* Inbox

** TODO Commit config updates
  [2020-10-09 Fri 10:05]
  [[file:~/Projects/Code/emacs-from-scratch/OrgFiles/Tasks.org::*Inbox][Inbox]]

** TODO Update Journal capture template
  [2020-10-09 Fri 10:06]
  [[file:~/Projects/Code/emacs-from-scratch/init.el::"j" "Journal Entries"]]

* Active

# ** NEXT Merge the PR                                                  :work:
# DEADLINE: <2020-10-12 Mon>
# ** NEXT Reply to John's e-mail                             :note:work:email:
# :PROPERTIES:
# :Effort:   3
# :END:
# ** NEXT Buy milk
# :PROPERTIES:
# :Effort:   20
# :END:

# ** DONE Finish documentation
# CLOSED: [2020-10-09 Fri 09:30] SCHEDULED: <2020-10-10 Sat>

** ☛ TODO Learn to use Clojure Hicups
SCHEDULED: <2021-03-21 Sun>
*** ☛ TODO 9meme challenge with hicups
SCHEDULED: <2021-03-22 Mon>



** NEXT Daily Mandarin Class
SCHEDULED: <2021-03-17 Wed +1d>
*** NEXT Class
SCHEDULED: <2021-03-17 Wed>
*** NEXT Exercises
SCHEDULED: <2021-03-17 Wed>
*** NEXT Anki
SCHEDULED: <2021-03-17 Wed>



** ✔ DONE Listar um mês de aniversários importantes 
CLOSED: [2021-03-17 Wed 09:37 +1d]
:LOGBOOK:
- State "✔ DONE"     from "NEXT"       [2021-03-17 Wed 09:37]
:END:
<2021-03-17 Wed>



** ☛ TODO System Crafters
*** NEXT 6 - Organize Your Life with Org Mode
:LOGBOOK:
- State "✔ DONE"     from "NEXT"       [2021-03-17 Wed 09:38]
:END:

** ☛ TODO Exercício globo 
<2021-03-19 Fri>

* Init customization pile and ideias
** ☛ TODO Togle evil mode and normal Emacs
<2021-03-21 Sun>
;; defun toggle-evilmode ()
;;   (interactive)
;;   (if (bound-and-true-p evil-local-mode)
;;     (progn
;;       ; go emacs
;;       (evil-local-mode (or -1 1))
;;       (undo-tree-mode (or -1 1))
;;       (set-variable 'cursor-type 'bar)
;;     )
;;     (progn
;;       ; go evil
;;       (evil-local-mode (or 1 1))
;;       (set-variable 'cursor-type 'box)
;;     )
;;   )
;; )
 
;; (global-set-key (kbd "M-u") 'toggle-evilmode)

* Backlog



# Faculdade
* Clojure(Script)
** TODO Swap!

Understand the syntax and functionality

#+begin_src clojure
  (swap! state/orders update id inc)
#+end_src

* John's input
[[junyu zhan]] : https://www.facebook.com/photo/?fbid=10157640361747303&set=gm.953073631938385
https://anagora.org/the-future-of-note-taking


* TODO Today
** NEXT Insert new summary and send Luiz Heleno
** TODO Website post
* DONE DONE 
** DONE Flow challenge 
CLOSED: [2021-07-06 Tue 09:31] SCHEDULED: <2021-06-25 Fri> DEADLINE: <2021-06-28 Mon>
:LOGBOOK:
- State "DONE"       from "BACKLOG"    [2021-07-06 Tue 09:31]
- State "DONE"       from "BACKLOG"    [2021-07-06 Tue 09:31]
- State "DONE"       from "NEXT"       [2021-06-30 Wed 12:37]
CLOCK: [2021-06-25 Fri 17:41]--[2021-06-25 Fri 17:41] =>  0:00
:END:
** DONE Anna's Statistics Work
CLOSED: [2021-08-11 Wed 14:07]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-08-11 Wed 14:07]
:END:
*** Notes
** DONE Wei-Liang [[file:Metrics.org::*\[\[file:Tasks.org::*Wei-Liang TCC\]\[TCC\]\]][TCC]]
CLOSED: [2021-08-11 Wed 14:08] SCHEDULED: <2021-06-22 Tue>
:LOGBOOK:
- State "DONE"       from "BACKLOG"    [2021-08-11 Wed 14:08]
- State "DONE"       from "NEXT"       [2021-08-11 Wed 14:08]
:END:
Hi, Pedro,

Thanks for the progress, few comments below

*** Abstract
I am not sure about the rules, but probably you will need an English version abstract.
Also, I am actually a bit slow to think of the organization of a paper/monograph when things are in Portuguese, but I will try.
*** DONE Introduction  - How pieces fit together
CLOSED: [2021-06-22 Tue 01:01]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-06-22 Tue 01:01]
:END:
In the introduction section, you will need a place to explain how each section of your monograph is about.
By enumerating the content of the entire writing, you need to explain the logic and relation between different parts of the monograph.
It seems still missing from the present version.

*** DONE Smoother Progression - Bibliography (Why EXWM?)
CLOSED: [2021-06-30 Wed 12:50]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-06-30 Wed 12:50]
:END:
The current content seems still a bit wild, you start from some very general concepts or notions (open source, and Linux) to some very specific applications.
Maybe, this can be somehow alleviated by adding some discussions about the general types/categories of open source software/operational systems.
Then mention that due to personal experience, we will only address a few specific ones of them.
(A more general argument will be to give a motivation about why you choose them, it is not necessary as it is just a monograph not a rigorous scientific research paper, so you will be forgiven).


# Profissional
*** 30 Jun
**** Results
**** Presentation
** DONE [[file:Tasks.org::*Wei-Liang TCC][TCC]]
CLOSED: [2021-08-20 Fri 13:57]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-08-20 Fri 13:57]
- State "DONE"       from "NEXT"       [2021-08-11 Wed 14:07]
CLOCK: [2021-07-09 Fri 11:30]--[2021-07-09 Fri 11:30] =>  0:00
:END:
*** Clocks 
CLOCK: [2021-07-03 Sat 20:20]--[2021-07-03 Sat 20:45] =>  0:25
CLOCK: [2021-07-06 Tue  05:00]--[2021-07-06 Tue 06:30] =>  1:30
CLOCK: [2021-07-06 Tue 09:28]--[2021-07-06 Tue 09:53] =>  0:25

** DONE Terminate subscription to Statistics Monitor program
CLOSED: [2021-08-20 Fri 13:57]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-08-20 Fri 13:57]
:END:

** DONE Read papers on Traffic
CLOSED: [2021-08-20 Fri 13:57]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-08-20 Fri 13:57]
:END:

** DONE Polish TCC-en
CLOSED: [2021-08-20 Fri 13:58]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-08-20 Fri 13:58]
:END:

** DONE University (1 Semester/2021)
CLOSED: [2021-09-01 Wed 13:45]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-09-01 Wed 13:45]
:END:
*** DONE LOM3203 - Controle e Automação
CLOSED: [2021-09-01 Wed 13:44] SCHEDULED: <2021-06-28 Mon> DEADLINE: <2021-07-08 Thu>
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-09-01 Wed 13:44]
- State "DONE"       from "NEXT"       [2021-07-09 Fri 16:44]
- State "DONE"       from "NEXT"       [2021-07-05 Mon 09:50]
:END:
3 aulas por dia
**** Clock
CLOCK: [2021-07-06 Tue 05:12]--[2021-07-06 Tue 05:37] =>  0:25

*** DONE LOM3213 - Fenômenos de Transporte
CLOSED: [2021-06-30 Wed 12:33]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-06-30 Wed 12:33]
:END:
- Aula 2: se cair é uma questão de múltipla escolha,
- Aula 3:  não vai cobrar teoria,
- Aula 4: exercícios sobre a aula 3, pode cair algum exercício desse. Exemplo: caixa de gelo, determinar o tempo do derretimento. Usar a *equação da condução, convecção ou radiação*.
- Aula 5: Não vai cobrar teoria, só exercício. 1 ou 2 exercícios de *regime transiente*. 1 ou 2 *exercícios de parede*.
**** Clock
*** DONE LOM 3230 - MEFIV
CLOSED: [2021-06-30 Wed 12:33]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-06-30 Wed 12:33]
:END:
**** Clocks
CLOCK: [2021-06-28 Mon 14:14]--[2021-06-28 Mon 14:39] =>  0:25
CLOCK: [2021-06-28 Mon 14:57]--[2021-06-28 Mon 15:22] =>  0:25
CLOCK: [2021-06-28 Mon 16:53]--[2021-06-28 Mon 17:18] =>  0:25
CLOCK: [2021-06-28 Mon 16:07]--[2021-06-28 Mon 16:32] =>  0:25
*** DONE LOM XXXX - Processos de Fabricação  
CLOSED: [2021-07-05 Mon 09:50]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-07-05 Mon 09:50]
:END:
*** Clocks
CLOCK: [2021-06-28 Mon 13:32]--[2021-06-28 Mon 13:57] =>  0:25
CLOCK: [2021-07-06 Tue 05:12]--[2021-07-06 Tue 05:37] =>  0:25
CLOCK: [2021-08-14 Sat 13:45]--[2021-08-14 Sat 14:10] =>  0:25
CLOCK: [2021-08-05 Thu 15:57]--[2021-08-05 Thu 15:57] =>  0:00
CLOCK: [2021-07-07 Wed 17:58]--[2021-07-07 Wed 17:58] =>  0:00
CLOCK: [2021-07-07 Wed 17:09]--[2021-07-07 Wed 17:34] =>  0:25
:END:

** DONE Read Chap 19, Numerical Recipes
CLOSED: [2021-09-01 Wed 13:45]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-09-01 Wed 13:45]
:END:
